{
  "blog": {
    "name": "谢伊的小屋",
    "footer": "Copyright 2016 © Xinyu Zhang. Powered by Innsbruck and Github.",
    "pagination": 15,
    "description": false,
    "google-analytics": "UA-78421867-1",
    "css": "body { max-width: none; }",
    "plugin": {
      "cname": "xyzhang.xyz",
      "google-fonts": "",
      "disqus": "xyzhangxyz",
      "rss": "http://xyzhang.xyz/atom.xml"
    }
  },
  "posts": [
    {
      "title": "Hello, Innsbruck.",
      "content": "在这个月初的时候，[戍爷](https://quietshu.github.io)告诉我他觉得现在现有的博客系统都太过重量级，在使用的时候，需要花不少功夫才能使得整个东西工作起来。于是他就开始动手写一个非常轻量的博客系统，并很快的实现了一个不错的版本。在向我展示的时候，这个项目已经具有不错的效果，看起来非常舒服，而且还设计了非常自由的插件系统，可以非常方便的对项目进行拓展，最重要的是，的确非常轻量。同时，戍爷还给这个项目起了一个非常棒的名字，[innsbruck](https://github.com/quietshu/innsbruck)。\r\n\r\n恰好最近因为手上的MB Air容量有限，更换了一台容量较大的MB Pro，在配新机器的环境的时候，索性直接将整个博客也都迁移到 innsbruck 上面来，在使用的过程之中为这个项目再做一些贡献，也算是在最近繁杂的环境之中做的一个有意义的事情吧，特别是最近更觉身体不适，还是减少其他的分心事情，专心的学习一段时间，写写代码，调理一下生活吧。",
      "link": "1",
      "time": 1464332373638,
      "plugin": {
        "thumbnail": ""
      }
    },
    {
      "title": "病与夏风与积雨云",
      "content": "这个月中的时候以学生教练的身份参加了在泰国普吉岛举行的ACM ICPC World Finals 2016，虽然说是收获颇丰，然而从普吉回来之后就一直觉得体力有些透支，一周没啥精神之后果然又发起了低烧，幸好早就开始吃药，在认认真真的睡了几天之后总算是有所缓解，虽然还是没什么体力，但是精神总算是恢复了，毕竟需要开始应对接下来的考试了呀。\r\n![夏天的积雨云_0.jpg](/static/夏天的积雨云_0.jpg)\r\n不过当人生病难受的时候，反而会更加意识到让自己觉得快乐的事情吧。发烧的那天夜里，在精神稍许好些，下楼买饮用水的时候，意外的发现外面的温度是如此的舒适，风吹在身上会让身体不由自主的舒服起来，如果非要比喻一下，那大约就像是喵星人被抚摸时舒服的眯起眼睛的那种感觉，是能够让人忘却一会身体的不快的感觉。而白天从两栋楼之间的四方的平整场地走过去的时候，就能够感受到风从两栋楼之间的缝隙穿过，然后绕着我飞舞了一周，把所有的一切都带走了。果然，被温柔的对待是如此一件令人沉醉的事情，夏天的风更加能够给人这种感觉吧。\r\n\r\n当然，跟夏风一起到来，还有夏天的积雨云吧。在很久之前看到细田守的纪录短片中，特别的提到了细田守作品中经常会出现的一个意象，那就是夏天的积雨云。\r\n ![夏天的积雨云.png](/static/夏天的积雨云.png)\r\n因为“积雨云会给天空带来生气勃勃的感觉”，所以非常喜欢细田守监督的《穿越时空的少女》和《夏日大作战》两部作品，蕴含在里面的，是能让人向上的力量吧。无论是望着远处的积雨云，感受着略带潮湿的风轻抚过脸庞带来的温柔的感觉，还是在这片生机勃勃的天空之下发生的令人愉快、失落或是呐喊的故事，其实都令人陶醉，不是吗？\r\n![夏天的积雨云_2.jpg](/static/夏天的积雨云_2.jpg)\r\n我想，这些时候的我，都如同《肖申克的救赎》中Andy开着车沿着太平洋向着自由兜风而去一样潇洒吧，那是如此的生机勃勃，即使只是片刻，也是要拼上一切去努力找寻的和解。愿在这片同样天空的温柔之下，所有人都能够幸福的生活。",
      "link": "2",
      "time": 1464714686999,
      "plugin": {
        "thumbnail": ""
      }
    },
    {
      "title": "《守望先锋》游戏谈",
      "content": "虽然马上就要进入考试周了，但是随着《守望先锋》(overwatch) 的推出，还是在上面扔了一大把的时间 /(ㄒoㄒ)/~~\r\n\r\n![overwatch.jpg](/static/overwatch.jpg \"《守望先锋》全家福\")\r\n\r\n先说结论，《守望先锋》绝对是年度大作级别的游戏，个人评价上是一个各方面都不输于  GTA 5 的作品，并且社区的反响也是相当火爆，说明暴雪继续延续了他们的精品传统，继续打造这块金招牌。在玩这个游戏的过程中，我也去查找了很多相关的知识，包括游戏背景、设计、评价等，游戏本身也是颇具一波三折吧。\r\n\r\n<center>\r\n![titan.jpg](/static/titan.jpg \"传说中的 Titan 项目\")\r\n</center>\r\n\r\n暴雪很久之前一直想要搞一个叫做《泰坦》的大新闻，这个游戏的设定相当庞大，白天的时候，游戏中的角色就是正常的生活上班，就像是在玩一个慢节奏的模拟游戏；而夜晚降临，则所有人都化身不同的阵营角色，开始一场快节奏的 FPS 对决。据说为了把白天的模拟部分搞得更好，暴雪还特地招募了《模拟人生》系列的研发人员。然而使用这样的设定存在一个比较严重的问题：当设定过于复杂时，无论是从设计还是开发角度，都需要更多的努力和能力来完成整个游戏。在这个方面，《DOOM启世录》中的《大刀》就是另一个反例，因为过多的设定和复杂的世界观，导致最后的作品无论是从开发还是游戏角度都变成了灾难级别。回到《泰坦》，因为设计和开发过于复杂，于是《泰坦》项目经过了若干年后，最后因为游戏性的问题宣布项目解散，虽然项目在新模式的尝试中失败了，但是却积累了很多的经验，而项目组中的一部分成员则保存了下来，继续开发夜晚的FPS部分，也就是现在的《守望先锋》。\r\n\r\n![TeamFortress2.jpg](/static/TeamFortress2.jpg \"同样是大作的《军团要塞 2》全家福\")\r\n\r\n从游戏模式上来说，《守望先锋》与V社很多年之前（2008年）发布的游戏《军团要塞 2》（Team Fortress 2）基本上是一样的，参考了很多 TF2 的设定（当然 TF2 的各种设定也有不同的历史出处），然后在这个基础上做了很多更适应形势的新的变化。第一处就是使用了暴雪擅长的卡通风格的游戏风格设计，并且在游戏背景情节上做了很合适的彩蛋和环境因素设计，人物的动作也设计的十分帅气，当然这是暴雪一贯擅长的部分；第二处就是对 PVP 中的游戏节奏、定位和计分板都做了新的尝试，包括玩家只能够看到自己的数据，另外还启用了匹配系统，同时这个匹配系统比 CS GO 的匹配系统更加科学合理，现在看起来这些新的尝试得到了社区非常好的反馈，在收集资料的过程中，看到知乎相关问题中已经有人对这个方面做了[更加详细的描述](https://www.zhihu.com/question/26525931/answer/99404152)，相当精彩。即使是V社同时推出了 TF3，相信《守望先锋》也会因为这些更适合的设计受到更多的关注（然而G胖并不认识 three 怎么拼）。\r\n\r\n总而言之，《守望先锋》虽然是旧瓶装新酒，但是最终的效果确实是好的令人吃惊，上面虽然没有提到，但是游戏在平衡性上作出的努力效果非常好，首先无论选怎样的阵容都会有不同的套路和打法，但是不同的阵容所侧重的方向就会有所不同，需要根据场上的形式不断调整，也让游戏具有更多的乐趣。现在看起来，的确是一个让所有人都满意游戏，是一个上手一玩就能感受到十分用心制作的精品游戏。从这几天的游戏体验而言，的确是让人欲罢不能的大作。\r\n\r\n当然，游戏虽然这么棒，但是接下来的一个月还是不要玩了吧，专心期末火葬场是真的o(╯□╰)o   ",
      "link": "3",
      "time": 1465054511043,
      "plugin": {
        "thumbnail": ""
      }
    }
  ],
  "pages": [
    {
      "title": "About",
      "content": "(｡･∀･)ﾉﾞ嗨，我是张新宇，一名正在上海念书的普通本科生，主修计算机科学与技术。平时最喜欢做的事情就是研究用心做出来的作品，比如去Github上看代码点Star，或者是去instagram评论Awesome，假象照片上的场景! （上面的作品们真是非常awesome）享受着连续发生的奇迹，偶尔也会尝试一丝变化，体力好的时候会渴望挑战，努力做着一个担当责任的人，也在克服着自己坚持力低下的缺点，希望和大家一起研究和经历这个复杂的世界，见证历史和存在。\r\n\r\n谢谢大家的注意。\r\n\r\n欢迎使用[RSS](http://xyzhang.xyz/atom.xml)来订阅这个博客站点来与我保持联络，也可以通过[douban](https://www.douban.com/people/perseawe/)或是[Github](https://github.com/zhangshea)来联络，如果更希望邮件联络的话，邮箱地址可以在Github上面找到。\r\n\r\n本站点所有的文章除去特别注明为转载或是遵守其他协议的情况，均发布在[Creative Commons 署名-非商业性使用-相同方式共享 3.0 协议](http://creativecommons.org/licenses/by-nc-sa/3.0/deed.zh)下，在本协议所限定下非商业使用的情况下可以自由的加以分享或是演绎，如需其他使用可以通过邮件联络。",
      "link": "about",
      "order": 0
    }
  ],
  "id": "3"
}